[
    {
        "title": "The Shawshank Redemption (1994)",
        "rating": "9.3",
        "totalRatings": "2,386,317",
        "poster": "https://m.media-amazon.com/images/M/MV5BMDFkYTc0MGEtZmNhMC00ZDIzLWFmNTEtODM1ZmRlYWMwMWFmXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_UX182_CR0,0,182,268_AL__QL50.jpg",
        "releaseDate": "14 October 1994 (USA)",
        "storyLine": "Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red.",
        "time": "2h 22min",
        "summary": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.",
        "trailerLink": "/video/imdb/vi3877612057?playlistId=tt0111161&ref_=tt_ov_vi",
        "creators": [
            "Frank Darabont",
            "Stephen King",
            "Frank Darabont",
            "Tim Robbins",
            "Morgan Freeman",
            "Bob Gunton"
        ],
        "achievements": [
            "Nominated for            7            Oscars.",
            "Another        21 wins & 36 nominations."
        ],
        "types": [
            "Drama"
        ]
    },
    {
        "title": "The Godfather (1972)",
        "rating": "9.2",
        "totalRatings": "1,653,843",
        "poster": "https://m.media-amazon.com/images/M/MV5BM2MyNjYxNmUtYTAwNi00MTYxLWJmNWYtYzZlODY3ZTk3OTFlXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_UY268_CR3,0,182,268_AL__QL50.jpg",
        "releaseDate": "24 March 1972 (USA)",
        "storyLine": "The Godfather \"Don\" Vito Corleone is the head of the Corleone mafia family in New York. He is at the event of his daughter's wedding. Michael, Vito's youngest son and a decorated WW II Marine is also present at the wedding. Michael seems to be uninterested in being a part of the family business. Vito is a powerful man, and is kind to all those who give him respect but is ruthless against those who do not. But when a powerful and treacherous rival wants to sell drugs and needs the Don's influence for the same, Vito refuses to do it. What follows is a clash between Vito's fading old values and the new ways which may cause Michael to do the thing he was most reluctant in doing and wage a mob war against all the other mafia families which could tear the Corleone family apart.",
        "time": "2h 55min",
        "summary": "An organized crime dynasty's aging patriarch transfers control of his clandestine empire to his reluctant son.",
        "trailerLink": "/video/imdb/vi1348706585?playlistId=tt0068646&ref_=tt_ov_vi",
        "creators": [
            "Francis Ford Coppola",
            "Mario Puzo",
            "Francis Ford Coppola",
            "Marlon Brando",
            "Al Pacino",
            "James Caan"
        ],
        "achievements": [
            "Won            3            Oscars.",
            "Another        29 wins & 30 nominations."
        ],
        "types": [
            "Crime",
            "Drama"
        ]
    },
    {
        "title": "The Godfather: Part II (1974)",
        "rating": "9.0",
        "totalRatings": "1,150,490",
        "poster": "https://m.media-amazon.com/images/M/MV5BMWMwMGQzZTItY2JlNC00OWZiLWIyMDctNDk2ZDQ2YjRjMWQ0XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_UY268_CR3,0,182,268_AL__QL50.jpg",
        "releaseDate": "18 December 1974 (USA)",
        "storyLine": "The continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba.",
        "time": "3h 22min",
        "summary": "The early life and career of Vito Corleone in 1920s New York City is portrayed, while his son, Michael, expands and tightens his grip on the family crime syndicate.",
        "trailerLink": "/video/imdb/vi696162841?playlistId=tt0071562&ref_=tt_ov_vi",
        "creators": [
            "Francis Ford Coppola",
            "Francis Ford Coppola",
            "Mario Puzo",
            "Al Pacino",
            "Robert De Niro",
            "Robert Duvall"
        ],
        "achievements": [
            "Won            6            Oscars.",
            "Another        11 wins & 20 nominations."
        ],
        "types": [
            "Crime",
            "Drama"
        ]
    },
    {
        "title": "The Dark Knight (2008)",
        "rating": "9.0",
        "totalRatings": "2,349,446",
        "poster": "https://m.media-amazon.com/images/M/MV5BMTMxNTMwODM0NF5BMl5BanBnXkFtZTcwODAyMTk2Mw@@._V1_UX182_CR0,0,182,268_AL__QL50.jpg",
        "releaseDate": "18 July 2008 (USA)",
        "storyLine": "Set within a year after the events of Batman Begins (2005), Batman, Lieutenant James Gordon, and new District Attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City, until a mysterious and sadistic criminal mastermind known only as \"The Joker\" appears in Gotham, creating a new wave of chaos. Batman's struggle against The Joker becomes deeply personal, forcing him to \"confront everything he believes\" and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent, and Rachel Dawes.",
        "time": "2h 32min",
        "summary": "When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.",
        "trailerLink": "/video/imdb/vi324468761?playlistId=tt0468569&ref_=tt_ov_vi",
        "creators": [
            "Christopher Nolan",
            "Jonathan Nolan",
            "Christopher Nolan",
            "Christian Bale",
            "Heath Ledger",
            "Aaron Eckhart"
        ],
        "achievements": [
            "Won            2            Oscars.",
            "Another        157 wins & 163 nominations."
        ],
        "types": [
            "Action",
            "Crime",
            "Drama"
        ]
    },
    {
        "title": "12 Angry Men (1957)",
        "rating": "9.0",
        "totalRatings": "704,416",
        "poster": "https://m.media-amazon.com/images/M/MV5BMWU4N2FjNzYtNTVkNC00NzQ0LTg0MjAtYTJlMjFhNGUxZDFmXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_UX182_CR0,0,182,268_AL__QL50.jpg",
        "releaseDate": "10 April 1957 (USA)",
        "storyLine": "The defense and the prosecution have rested, and the jury is filing into the jury room to decide if a young man is guilty or innocent of murdering his father. What begins as an open-and-shut case of murder soon becomes a detective story that presents a succession of clues creating doubt, and a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, AND each other. Based on the play, all of the action takes place on the stage of the jury room.",
        "time": "1h 36min",
        "summary": "A jury holdout attempts to prevent a miscarriage of justice by forcing his colleagues to reconsider the evidence.",
        "trailerLink": "/video/imdb/vi3452609817?playlistId=tt0050083&ref_=tt_ov_vi",
        "creators": [
            "Sidney Lumet",
            "Reginald Rose",
            "Reginald Rose",
            "Henry Fonda",
            "Lee J. Cobb",
            "Martin Balsam"
        ],
        "achievements": [
            "Nominated for            3            Oscars.",
            "Another        17 wins & 10 nominations."
        ],
        "types": [
            "Crime",
            "Drama"
        ]
    },
    {
        "title": "Schindler's List (1993)",
        "rating": "8.9",
        "totalRatings": "1,233,659",
        "poster": "https://m.media-amazon.com/images/M/MV5BNDE4OTMxMTctNmRhYy00NWE2LTg3YzItYTk3M2UwOTU5Njg4XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_UX182_CR0,0,182,268_AL__QL50.jpg",
        "releaseDate": "4 February 1994 (USA)",
        "storyLine": "Oskar Schindler is a vain and greedy German businessman who becomes an unlikely humanitarian amid the barbaric German Nazi reign when he feels compelled to turn his factory into a refuge for Jews. Based on the true story of Oskar Schindler who managed to save about 1100 Jews from being gassed at the Auschwitz concentration camp, it is a testament to the good in all of us.",
        "time": "3h 15min",
        "summary": "In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.",
        "trailerLink": "/video/imdb/vi1158527769?playlistId=tt0108052&ref_=tt_ov_vi",
        "creators": [
            "Steven Spielberg",
            "Thomas Keneally",
            "Steven Zaillian",
            "Liam Neeson",
            "Ralph Fiennes",
            "Ben Kingsley"
        ],
        "achievements": [
            "Won            7            Oscars.",
            "Another        85 wins & 49 nominations."
        ],
        "types": [
            "Biography",
            "Drama",
            "History"
        ]
    },
    {
        "title": "The Lord of the Rings: The Return of the King (2003)",
        "rating": "8.9",
        "totalRatings": "1,669,019",
        "poster": "https://m.media-amazon.com/images/M/MV5BNzA5ZDNlZWMtM2NhNS00NDJjLTk4NDItYTRmY2EwMWZlMTY3XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_UX182_CR0,0,182,268_AL__QL50.jpg",
        "releaseDate": "17 December 2003 (USA)",
        "storyLine": "The final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Frodo and Sam reach Mordor in their quest to destroy the One Ring, while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith.",
        "time": "3h 21min",
        "summary": "Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.",
        "trailerLink": "/video/imdb/vi2073101337?playlistId=tt0167260&ref_=tt_ov_vi",
        "creators": [
            "Peter Jackson",
            "J.R.R. Tolkien",
            "Fran Walsh",
            "Elijah Wood",
            "Viggo Mortensen",
            "Ian McKellen"
        ],
        "achievements": [
            "Won            11            Oscars.",
            "Another        198 wins & 124 nominations."
        ],
        "types": [
            "Action",
            "Adventure",
            "Drama"
        ]
    },
    {
        "title": "Pulp Fiction (1994)",
        "rating": "8.9",
        "totalRatings": "1,858,477",
        "poster": "https://m.media-amazon.com/images/M/MV5BNGNhMDIzZTUtNTBlZi00MTRlLWFjM2ItYzViMjE3YzI5MjljXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_UY268_CR1,0,182,268_AL__QL50.jpg",
        "releaseDate": "14 October 1994 (USA)",
        "storyLine": "Jules Winnfield (Samuel L. Jackson) and Vincent Vega (John Travolta) are two hit men who are out to retrieve a suitcase stolen from their employer, mob boss Marsellus Wallace (Ving Rhames). Wallace has also asked Vincent to take his wife Mia (Uma Thurman) out a few days later when Wallace himself will be out of town. Butch Coolidge (Bruce Willis) is an aging boxer who is paid by Wallace to lose his fight. The lives of these seemingly unrelated people are woven together comprising of a series of funny, bizarre and uncalled-for incidents.",
        "time": "2h 34min",
        "summary": "The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.",
        "trailerLink": "/video/imdb/vi2620371481?playlistId=tt0110912&ref_=tt_ov_vi",
        "creators": [
            "Quentin Tarantino",
            "Quentin Tarantino",
            "Roger Avary",
            "John Travolta",
            "Uma Thurman",
            "Samuel L. Jackson"
        ],
        "achievements": [
            "Won            1            Oscar.",
            "Another        69 wins & 75 nominations."
        ],
        "types": [
            "Crime",
            "Drama"
        ]
    },{
        "title": "The Good, the Bad and the Ugly (1966)",
        "rating": "8.8",
        "totalRatings": "699,065",
        "poster": "https://m.media-amazon.com/images/M/MV5BOTQ5NDI3MTI4MF5BMl5BanBnXkFtZTgwNDQ4ODE5MDE@._V1_UX182_CR0,0,182,268_AL__QL50.jpg",
        "releaseDate": "29 December 1967 (USA)",
        "storyLine": "Blondie (The Good) (Clint Eastwood) is a professional gunslinger who is out trying to earn a few dollars. Angel Eyes (The Bad) (Lee Van Cleef) is a hitman who always commits to a task and sees it through, as long as he is paid to do so. And Tuco (The Ugly) (Eli Wallach) is a wanted outlaw trying to take care of his own hide. Tuco and Blondie share a partnership together making money off of Tuco's bounty, but when Blondie unties the partnership, Tuco tries to hunt down Blondie. When Blondie and Tuco come across a horse carriage loaded with dead bodies, they soon learn from the only survivor, Bill Carson (Antonio Casale), that he and a few other men have buried a stash of gold in a cemetery. Unfortunately, Carson dies and Tuco only finds out the name of the cemetery, while Blondie finds out the name on the grave. Now the two must keep each other alive in order to find the gold. Angel Eyes (who had been looking for Bill Carson) discovers that Tuco and Blondie met with Carson and knows ...",
        "time": "2h 58min",
        "summary": "A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.",
        "trailerLink": "/video/imdb/vi3416964889?playlistId=tt0060196&ref_=tt_ov_vi",
        "creators": [
            "Sergio Leone",
            "Luciano Vincenzoni",
            "Sergio Leone",
            "Clint Eastwood",
            "Eli Wallach",
            "Lee Van Cleef"
        ],
        "achievements": [
            "4 wins & 6 nominations."
        ],
        "types": [
            "Western"
        ]
    },
    {
        "title": "The Lord of the Rings: The Fellowship of the Ring (2001)",
        "rating": "8.8",
        "totalRatings": "1,689,664",
        "poster": "https://m.media-amazon.com/images/M/MV5BN2EyZjM3NzUtNWUzMi00MTgxLWI0NTctMzY4M2VlOTdjZWRiXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UX182_CR0,0,182,268_AL__QL50.jpg",
        "releaseDate": "19 December 2001 (USA)",
        "storyLine": "An ancient Ring thought lost for centuries has been found, and through a strange twist of fate has been given to a small Hobbit named Frodo. When Gandalf discovers the Ring is in fact the One Ring of the Dark Lord Sauron, Frodo must make an epic quest to the Cracks of Doom in order to destroy it. However, he does not go alone. He is joined by Gandalf, Legolas the elf, Gimli the Dwarf, Aragorn, Boromir, and his three Hobbit friends Merry, Pippin, and Samwise. Through mountains, snow, darkness, forests, rivers and plains, facing evil and danger at every corner the Fellowship of the Ring must go. Their quest to destroy the One Ring is the only hope for the end of the Dark Lords reign.",
        "time": "2h 58min",
        "summary": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.",
        "trailerLink": "/video/imdb/vi2073101337?playlistId=tt0120737&ref_=tt_ov_vi",
        "creators": [
            "Peter Jackson",
            "J.R.R. Tolkien",
            "Fran Walsh",
            "Elijah Wood",
            "Ian McKellen",
            "Orlando Bloom"
        ],
        "achievements": [
            "Won            4            Oscars.",
            "Another        117 wins & 126 nominations."
        ],
        "types": [
            "Action",
            "Adventure",
            "Drama"
        ]
    }
]